In [1]:
import pandas as pd
df = pd.read_csv('data/test3.csv')
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
5  a   1   1

In [2]:
#중복된 데이터 확인(첫번째 기준, 중복 시 True)
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [3]:
df.duplicated().sum()

2

In [5]:
df.drop_duplicates(inplace=True)
df

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [6]:
#인덱스를 새로운 열로 추가
df.reset_index(inplace=True)
df

   index c1  c2  c3
0      0  a   1   1
1      2  b   1   2
2      3  a   2   2
3      4  b   2   2